app/controllers/accessions_controller.rb

  def agreements
    @results = Accession.agreements.select(:title, :acquisitionType, :resourceType, :agreementSentDate, :agreementSent).distinct
---
SELECT title as 'Title', agreementSent as 'Sent', agreementSentDate as 'Date Sent', agreementReceived as 'Received', agreementReceivedDate as 'Date Received' FROM `Accessions` WHERE agreementReceived is NULL